Repository: jimregan/citizens-information-raw
Catalog: en-ga/www.citizensinformation.ie/ga/moving_country/moving_to_ireland/rights_of_residence_in_ireland/residence_rights_of_non_eea_nationals_in_ireland.html.txt.tmx
Source language: en
Languages: ga

source: Residence rights of non-EEA nationals
ga: Cearta cónaithe náisiúnach neamh-LEE

source: If you are not a citizen of the European Economic Area (EEA) or Switzerland, there are various forms of residence rights (permission to remain) that allow you to live in Ireland
ga: Mura bhfuil tú i do shaoránach den Limistéar Eorpach Eacnamaíoch (LEE) nó den Eilvéis, tá foirmeacha éagsúla de chearta cónaithe (cead chun fanacht) a ligeann duit cónaí in Éirinn

source: Permission to remain in Ireland is granted by the Department of Justice and Equality and consists of a special stamp endorsed on your passport
ga: Is í an Roinn Dlí agus Cirt agus Comhionannais a thugann an cead chun fanacht in Éirinn agus is é atá i gceist le cead chun fanacht ná stampa speisialta formhuinithe ar do phas

source: This is usually called a residence stamp
ga: Tugtar stampa cónaithe ar seo de ghnáth

source: The various types of stamp and their meanings are covered in our document, Types of residence permission for non-EEA nationals
ga: Clúdaítear na cineálacha éagsúla stampaí agus an méid a gciallaíonn siad go mion inár ndoiciméad, Cineálacha an cheada cónaithe do náisiúnaigh neamh-LEE

source: If you are granted permission to remain, a Certificate of Registration is endorsed on your passport - see ‘Certificate of Registration below’ below
ga: Má thugtar cead duit fanacht, formhuinítear Deimhniú Clárúcháin ar do phas - féach 'Deimhniú Clárúcháin' thíos

source: Depending on the circumstances, members of your family may be able to come to Ireland with you, or to join you when you are here – see ‘Family members’ below
ga: Ag brath ar na cúinsí, d'fhéadfadh go mbeadh baill de do theaghlach in ann teacht go hÉirinn in éineacht leat, nó teacht chugat nuair atá tú anseo - féach 'Baill teaghlaigh' thíos

source: Changes to immigration law
ga: Na hathruithe atá molta ar an dlí ar inimirce

source: The International Protection Act 2015, which came into effect on 31 December 2016, provides for a single application procedure for international protection (refugee status and subsidiary protection) and permission to remain
ga: Soláthraíonn an tAcht um Chosaint Idirnáisiúnta 2015, a thosaíonn an 31 Nollaig 2016, nós imeachta aonair iarratas ar cosaint idirnáisiúnta (stádas dídeanaithe agus fhochosaint) agus chead chun fanacht

source: If you are a non-EEA national and intend to come to live in Ireland, there are several important pieces of documentation that you will need before coming here
ga: Más náisiúnach neamh-LEE tú agus go bhfuil sé ar intinn agat teacht chun cónaí in Éirinn, tá roinnt cáipéisí tábhachtacha ar gá a bheith agat sula dtagann tú anseo

source: • Your passport: which must be valid for at least the duration of your proposed stay
ga: • Do phas: ar gá a bheith bailí ar feadh na tréimhse atá ar intinn agat fanacht ar a laghad

source: • The relevant visa: if you are a citizen of a visa-required country
ga: • An víosa ábhartha: más saoránach de thír dá bhfuil víosa ag teastáil tú

source: • An employment permit, business visa or business permission: if you intend to work or engage in business in Ireland
ga: • Cead fostaíochta, víosa gnó nó cead gnó: má tá sé ar intinn agat obair nó dul i mbun gnó agus tú in Éirinn

source: An immigration officer will examine your documentation when you present yourself at the point of entry to Ireland
ga: Déanfaidh oifigeach inimirce iniúchadh ar do cháipéisí nuair a chuirfidh tú tú féin i láthair ag an bpointe isteach go hÉireann

source: You may be asked to show evidence that you have enough funds to support yourself and any dependants for the duration of your proposed stay
ga: D'fhéadfaí iarraidh ort fianaise a thaispeáint go bhfuil go leor airgid agat chun tú féin agus aon chleithiúnaithe a chothú don tréimhse atá ar intinn agat fanacht

source: You may also be required to answer other questions relevant to your application for permission to remain
ga: D'fhéadfadh go mbeadh ort ceisteanna eile a fhreagairt a bhaineann led' iarratas ar chead chun fanacht

source: The onus rests with you to satisfy the immigration officer as to the genuine reason for your presence in Ireland
ga: Tá sé de dhualgas ortsa an t-oifigeach inimirce a shásamh go bhfuil cúis mhaith agat do bheith in Éirinn

source: In other words, you must satisfy them that your credentials are authentic
ga: Ciallaíonn sé sin gur gá duit iad a shásamh go bhfuil d'fhaisnéis aitheantais barántúil

source: Requirement to produce identity documents
ga: Riachtanas doiciméid aitheantais a thabhairt ar aird

source: The Civil Law (Miscellaneous Provisions) Act 2011 (section 34) provides that non-EEA nationals arriving in the State must present a passport or equivalent document when asked for it by an immigration officer
ga: Soláthraíonn an tAcht um an Dlí Sibhialta (Forálacha Ilghnéitheacha) 2011 alt 34 gur mór do náisiúnaigh neamh-LEE atá ag teacht isteach sa Stát, pas nó doiciméad coibhéiseach a thabhairt nuair a iarrann oifigeach imirce orthu

source: (Previously, it was not specifically stated that they had to present it.) It also requires non-EEA nationals who are present in the State to provide such a document or a registration certificate on demand to the Minister, an immigration officer or a Garda, if asked to do so to prove that they comply with their permission to remain in the State
ga: Éilítear ar náisiúnaigh neamh-LEE atá láithreach sa Stát doiciméad nó teastas chlárú a thabhairt don Aire, d’oifigeach imirce nó do Gharda, má iarrtar orthu, chun cruthú um chomhlíonadh ceada fanacht sa Stát

source: This requirement does not apply to people under 16 years of age, but it does now apply to non-EEA nationals who were born in Ireland
ga: Ní bhaineann an riachtanas seo le daoine faoi bhun 16 bliana d’aois ach baineann sé anois le náisiúnaigh neamh-LEE a rugadh in Éirinn

source: Section 34 does not apply to people who are exercising EU Treaty Rights of free movement
ga: Ní bhaineann Alt 34 le daoine a fheidhmíonn an ceart atá acu chun saorghluaiseachta

source: However, anyone seeking to enter or live in the State on the basis of being an EEA national or a dependant of an EEA national is still required to provide satisfactory evidence of identity and nationality to establish that basis
ga: Áfach, má iarrann aon duine cead teacht isteach nó cónaí in Éirinn ar bhonn náisiúntacht LEE nó cleithiúnaí náisiúnaigh LEE, ní mór dóibh leorfhianaise aitheantais agus náisiúntachta a sholáthar chun an bonn seo a fhaigh amach

source: If everything is in order, the immigration officer will place the appropriate stamp on your passport
ga: Má tá gach rud in ord, cuirfidh an t-oifigeach inimirce an stampa cuí ar do phas

source: If your stay is for longer than 3 months, you will have to register with the Burgh Quay Registration Office or your local immigration office who will issue you with a Certificate of Registration (also known as a GNIB card) - see 'How to apply' below
ga: Má bheidh tú ag fanacht níos faide ná 3 mhí, beidh ort clárú le hOifig Chlárúcháin Cé an Bhúrcaigh. nó led' oifig inimirce áitiúil agus eiseoidh siad Deimhniú Clárúcháin (ar a dtugtar cárta BNGSI chomh maith) duit - féach 'Conas iarratas a dhéanamh' thíos

source: It is the same size as a credit card and will show what type of residence stamp you hold
ga: Tá sé ar cóimhéid le cárta creidmheasa agus taispeánfaidh sé an cineál stampa cónaithe atá agat

source: Depending on your nationality and your legal status in Ireland, this card may also function as a residence card, or residence document – see below
ga: Ag brath ar do náisiúntacht agus do stádas dlíthiúil in Éirinn, féadann an cárta seo feidhmiú mar chárta cónaithe chomh maith, nó mar cháipéis cónaithe - féach thíos

source: It is not an identity document: it is just a certificate that you have registered as required by Irish immigration law
ga: Ní cáipéis aitheantais í: níl ann ach deimhniú gur chláraigh tú de réir mar is gá faoi dhlí inimirce na hÉireann

source: Change of immigration status: If you currently have permission to remain and a valid Certificate of Registration, it is possible to apply to change your immigration status
ga: Athrú stádas inimirce: Má tá cead chun fanacht agus Deimhniú Clárúcháin agat, is féidir iarratas a dhéanamh chun do stádas inimirce a athrú

source: Your right to have family members come to live with you depends on the rules governing your presence in Ireland
ga: Bíonn sé de cheart agat mar sin baill do theaghlaigh a thabhairt chun cónaí leat ag brath ar na rialacha a ghabhann le do láithreacht in Éirinn

source: For example, if you have a General Employment Permit, you may be able to bring your family to live here after you have been legally working here for a year
ga: Mar shampla, má tá cead oibre agat, d'fhéadfá do theaghlach a thabhairt chun cónaí anseo tar éis duit a bheith ag obair anseo go dlíthiúil ar feadh bliana

source: You must also be able to show that you can support them without recourse to public funds
ga: Caithfidh tú a thaispeáint freisin go mbeidh tú in ann iad a chothú gan dul ar iontaoibh cistí poiblí

source: In practice, this means that you have enough money to support them without qualifying for Family Income Supplement (FIS)
ga: I gcleachtadh, ciallaíonn sé seo go bhfuil go leor airgid agat chun iad a chothú gan cháiliú d’Fhorlíonadh Ioncam Teaghlaigh (FIT)

source: This payment depends on your income and the number of dependants you have
ga: Braitheann an íocaíocht ar d'ioncam agus ar an méid cleithiúnaithe atá agat

source: You can read more in our document on residence rights for family members
ga: Tá tuilleadh faisnéise ar fáil inár ndoiciméad faoi chearta cónaithe do bhaill teaghlaigh

source: Visitors and others who are not allowed to work
ga: Cuairteoirí agus daoine eile nach bhfuil cead acu obair

source: If you are coming to Ireland as a visitor, a tourist, the spouse, civil partner or dependant of an employment permit holder, or in order to receive medical treatment, you will get a stamp number 3 on your passport
ga: Má tá tú ag teacht go hÉirinn mar chuairteoir, thurasóir, chéile, pháirtnéir sibhialta nó chleithiúnaí dhuine a bhfuil cead fostaíochta acu nó chun cóireáil leighis a fháil, gheobhaidh tú stampa uimhir 3 ar do phas

source: If you have a stamp 3 you will not be entitled to work or engage in any business or profession while in Ireland
ga: Má tá stampa 3 agat ní bheidh tú i dteideal oibriú ná dul i mbun gnó nó gairme ar bith fad is atá tú in Éirinn

source: The length of time that this stamp is valid will depend on your circumstances
ga: Braithfidh an tréimhse dá mbeidh an stampa seo bailí ar do chúinsí

source: Once they are legally resident in the State, spouses, recognised partners, civil partners and dependants of holders of Critical Skills Employment Permits, former Green Card permits and researchers can apply for a Dependant/Partner/Spousal Employment Permit
ga: Fad is atá siad ina gcónaí go dleathach sa Stát, tá cead ag céilí, páirtnéirí sibhialta agus cleithiúnaithe de chuid sealbhóirí Ceadanna Fostaíochta Scileanna Ríthábhachtacha, ceadanna reatha an Chárta Ghlais nó taighdeoirí iarratas a chur isteach ar Chead Fostaíochta Cleithiúnaí/Páirtnéara/Céile

source: People who are allowed to work
ga: Daoine a bhfuil cead acu obair

source: In general, if you are a non-EEA national you must have an employment permit to work in Ireland
ga: Go ginearálta, más náisiúnaigh neamh-LEE thú, ní mór duit cead fostaíochta chun oibriú in Éirinn

source: Certain non-EEA students may take up casual work
ga: Is féidir le mic léinn neamh-LEE áirithe obair ócáideach a dhéanamh

source: Also, the following groups of people who have been granted a stamp 4 residence permission do not need permission to work in Ireland
ga: Chomh maith le sin ní gá do na grúpaí daoine áirithe seo a leanas atá stampa 4 cead cónaithe acu chead chun bheith ag obair in Éirinn:

source: If you are a non-EEA family member granted permission to remain under EU Treaty Rights, when you register with your local immigration registration office, you will receive your residence card with wording 4 EU FAM
ga: Más ball teaghlaigh neamh-LEE tú de shaoránach LEE nó Eilvéiseach a bhronnadh cead fanachta faoi Chearta Conartha AE, gheobhaidh tú do chárta cónaithe 4 EU FAM

source: As a holder of the card 4 EU FAM, you will be visa-exempt even if you are a visa-required national and you do not need an employment permit or business permission
ga: Ina sealbhóir cárta 4 EU FAM, beifeá díolmhaithe ó víosa cé nach bhfuil ar gá duit víosaí a bheith agat, agus ní gá duit cead fostaíochta nó cead gnó

source: Employment permit for 5 years
ga: Cead fostaíochta ar 5 bhliain

source: If you have worked on an employment permit for 5 consecutive years you will no longer need a permit to work in Ireland
ga: Má tá obair ar chead fostaíochta le 5 bhliain as a chéile déanta agat, ní gá duit cead oibre a bheith agat a thuilleadh

source: You should apply to your local immigration officer – see ‘How to apply’ below – who will issue you with a stamp 4 immigration permission for one year
ga: Ba chóir duit dul i dteagmháil le d' oifigeach inimirce áitiúil - féach 'Clárú' thíos - agus eiseoidh sé cead inimirce stampa 4 ar feadh aon bhliain amháin duit

source: This permission may be renewed annually and it will allow you to take up any employment or self-employment
ga: Is féidir leat an cead a athnuachan gach bliain agus beidh tú ceadaithe chun aon fhostaíocht nó féinfhostaíocht a dhéanamh

source: Further details about this immigration permission are available on the INIS website
ga: Tá tuilleadh faisnéise faoin chead inimirceach seo ar fáil ar inis.gov.ie

source: If you are in Ireland as the spouse, civil partner or dependant of an Irish or other EEA national, or of a Swiss national, you will get a stamp 4, which means that you will not need an employment permit or business permission
ga: Má tá tú in Éirinn mar chéile, pháirtnéir sibhialta nó chleithiúnaí náisiúnach Éireannach nó náisiúnach LEE eile, nó náisiúnach Eilvéiseach, gheobhaidh tú stampa 4. Ciallaíonn sé sin nach gá duit cead fostaíochta ná cead gnó a fháil

source: When you register with the local immigration office, the Certificate of Registration (GNIB card) that you receive will be a residence document
ga: Má chláraíonn tú leis na Gardaí, beidh an Deimhniú Clárúcháin (cárta BNGSI) a fhaigheann tú ina cáipéis chónaithe

source: You will also get stamp 4 if you come under one of the following categories: Convention or Programme refugees; former asylum seekers granted permission to remain
ga: Gheobhaidh tú stampa 4 má thagann tú faoi cheann ar bith de na catagóirí seo a leanas: Dídeanaithe Coinbhinsiúin nó Cláir; iar-iarrthóirí tearmainn a tugtar cead chun fanacht dóibh

source: This stamp also applies if you are on an intra-company transfer
ga: Baineann an stampa seo leat chomh maith má tá tú ar aistriú laistigh de chuideachta

source: Depending on your circumstances, you can acquire long-term residence rights if you have been legally resident in Ireland for 5 years or more
ga: Ag brath ar do chúinsí, d'fhéadfá cearta cónaithe fadtéarmacha a fháil má tá tú i do chónaí go dleathach in Éirinn le 5 bliana anuas nó níos mó

source: You will still need to register with the Garda authorities and obtain a Certificate of Registration but you will not need an employment permit
ga: Caithfidh tú clárú le húdaráis an Gharda Síochána agus Deimhniú Clárúcháin a fháil ach ní gá duit cead fostaíochta a bheith acu

source: If you have been here on the basis of employment permit conditions for over 5 years, you may apply for long term residency for a further 5 years
ga: Má tá tú anseo ar bhonn choinníollacha ceada oibre le 5 bliana anuas nó níos mó, is féidir leat iarratas a chur isteach ar chead cónaithe sínte do 5 bliana eile

source: Your spouse or civil partner and dependants may also apply for long-term residency if they have been legally resident in Ireland for at least 5 years
ga: Is féidir le do chéile, pháirtnéir sibhialta agus do chleithiúnaithe cur isteach ar chónaí fadtéarmach chomh maith má tá siad ina gcónaí go dleathach in Éirinn le 5 bliana anuas ar a laghad

source: If you are successful you will get a stamp number 4 on your passport for 5 years and you will no longer need a permit to work in Ireland
ga: Má éiríonn led' iarratas, gheobhaidh tú stampa uimhir 4 ar do phas ar feadh 5 bliana agus ní gá duit cead chun obair in Éirinn

source: Your dependants will get a stamp number 3 and will still be required to have an employment permit. For further information contact INISLongTermRes@justice.ie
ga: Gheobhaidh do chleithiúnaithe stampa uimhir 3 agus beidh riachtanas go mbeadh cead fostaíochta acu chun obair in Éirinn

source: Otherwise, if you have been legally resident for over 8 years (but not as a student or an asylum-seeker) you may apply for stamp number 5 on your passport, which gives you permission to remain in Ireland "without condition as to time”
ga: Seachas sin, má tá tú i do chónaí anseo go dleathach le breise agus 8 mbliana anuas (ach ní mar mhac léinn nó iarrthóir tearmainn) is féidir leat iarratas a chur isteach ar stampa uimhir 5 a fháil ar do phas, a thugann cead duit fanacht in Éirinn "gan choinníoll ama a bheith air"

source: You will be entitled to work or engage in a business or profession while in Ireland
ga: Beidh tú i dteideal oibriú nó dul i mbun gnó nó gairme fad is atá tú in Éirinn

source: This stamp lasts until the expiry date of your passport, and can be renewed when you get a new passport
ga: Fanann an stampa bailí go dtí dáta éagtha do phas, agus is féidir é a athnuachan nuair a fhaigheann tú pas nua

source: If you have a stamp 4 EU-FAM on your passport, you may apply for a permanent residence card after 5 years in the State – see ‘How to apply’ below. If successful you will be issued with a permanent residence card for 5 years
ga: Má tá stampa 4 EU-FAM ar do phas agat, is féidir leat iarratas a chur isteach ar chárta cónaithe buan i ndiaidh duit 5 bliana a chaitheamh sa Stát - féach 'Conas iarratas a dhéanamh' thíos

source: It is also possible to apply for Irish citizenship through naturalisation after you have built up 5 years of reckonable residence for citizenship purposes
ga: Is féidir iarratas a chur isteach ar shaoránacht Éireannach trí eadóirseacht chomh maith, i ndiaidh duit 5 bliana de chónaí ináirithe do chúiseanna saoránachta a chaitheamh anseo

source: The residence requirements for citizenship through marriage to or civil partnership with an Irish citizen are more lenient
ga: Tá na riachtanais do chónaí maidir le saoránacht trí shaoránach Éireannach a phósadh nó páirtnéireacht shibhialta a dhéanamh níos trócairí

source: There is a fee of €300 for the Certificate of Registration, but you do not have to pay a fee if you are:
ga: Tá táille €300 ar an Deimhniú Clárúcháin, ach níl ort an táille a íoc má tá tú i do:

source: • A person who has been reunified with such a refugee under Section 18 of the Refugee Act 1996
ga: • Dhuine a athaontaíodh le dídeanaí dá leithéid faoi Alt 18 d'Acht na nDídeanaithe 1996

source: • Under the age of 18 at the time of registration
ga: • Dhuine faoi bhun aois 18 ag am an chlárúcháin

source: • The spouse, civil partner, widow, widower or surviving civil partner of an Irish citizen
ga: • Chéile, pháirtnéir sibhialta, baintreach no baintreach fir nó pháirtnéir sibhialta marthanach le saoránach Éireannach

source: • A family member of an EU national and you qualify for a residence card under the European Communities (Free Movement of Persons) Regulations 2015
ga: • Chleithiúnach ar náisiúnach AE agus go gcáilíonn tú ar chárta cónaithe faoi Rialacháin na gComhphobal Eorpach (Saorghluaiseacht Daoine) 2015

source: Long Term Residency: Under the Long Term Residency (Fees) Regulations 2009 you must pay a fee of €500 when you are granted long term residency
ga: Cónaí Fadtéarmacha: Faoi na Rialacháin Cónaithe Fadtéarmacha (Táillí) 2009 caithfidh tú táille €500 a íoc nuair deonófar thú cónaí fadtéarmacha

source: If you are staying in Ireland for longer than 3 months you should go to your local immigration registration office as soon as possible following your arrival in Ireland
ga: Má tá tú ag fanacht in Éirinn níos faide ná 3 mhí ba chóir duit dul chuig d'oifig chlárúcháin inimirce áitiúil. Iarraidh labhairt leis an oifigeach clárúcháin chomh luath agus is féidir nuair a shroicheann tú Éire

source: Within the Dublin area, the registration office is the Burgh Quay Registration Office - see 'Where to apply' below
ga: Laistigh de cheantar Bhaile Átha Cliath, is é an Oifig Chlárúcháin Cé an Bhúrcaigh - féach 'Cá háit a dhéanfaidh mé iarratas' thíos

source: Since 15 September 2016, you must book an appointment online to visit it
ga: Ó 15 Meán Fómhair 2016, caithfidh tú coinne a scríobh isteach ar líne chun cuairt a thabhairt air

source: Outside Dublin, it is the regional registration office or the local Garda District Headquarters
ga: Lasmuigh de Bhaile Átha Cliath, is é oifig chlárúcháin régiúnach nó Ceanncheathrú Cheantair Áitiúil na nGardaí

source: You apply using form EU 1 (pdf) and explanatory leaflet (pdf) for a qualified family member or form EU 1A (pdf) and explanatory leaflet (pdf) for a permitted family member
ga: Caithfidh tú iarratas a dhéanamh ag baint leas as an bhfoirm EU 1 (pdf) do bhall teaghlaigh cáilithe agus as an mbileog mhínitheach (pdf) agus as an bhfoirm EU 1A (pdf) do bhall teaghlaigh ceadaithe agus as an mbileog mhínitheach (pdf)

source: For a permanent residence card for a family member who has lived in the State for 5 years apply using the application form EU 3 (pdf) and explanatory leaflet (pdf)
ga: Le haghaidh cárta cónaithe buan do bhall teaghlaigh atá ina chónaí sa Stát le 5 bliana anuas cuir iarratas isteach ag baint leasa as an bhfoirm iarratais EU 3 (pdf) agus as an mbileog mhínitheach (pdf)

source: Completed application forms should be returned to the EU Treaty Rights Section of the Irish Naturalisation and Immigration Service
ga: Ba chóir foirmeacha iarratais comhlánaithe a sheoladh ar ais chuig an Rannóg um Chearta sa Chonradh AE de chuid Sheirbhís Eadóirseachta agus Inimirce na hÉireann (SEIÉ)
